from django.core.management.base import BaseCommand
from users.models import Stage, Question, Explanation
class Command(BaseCommand):
    help = 'Populates Stage, Question, and Explanation models with predefined data'

    def handle(self, *args, **kwargs):
        therapy_data = {
  "therapySessions": [
    {
      "stage": "استراتيجية وضع الاهداف",
      "description": "تعليم الطلبة كيفية تحديد الاهداف الشخصية و الاكادينية بطريقة فعالة و واقعية ، لتعزيز شعورهم بالإنجاز و الثقة بالنفس",
      "explanations": [
        "شرح مفهوم الاهداف و كيف تؤثر على الثقة بالنفس",
        "توضيح الفرق بين الاهداف طويلة الاجل و قصيرة الاجل",
        "عرض امثلة عن كيفية تحسين الثقة بالنفس من خلال تحقيق الاهداف الصغيرة",
        "تعريف معايير SMART",
        "توضيخ اهمية كل معيار في بناء الثقة بالنفس"
      ],
      "questions": [
        "اطلب من الطالب تحديد هدف عام",
        "اطلب من الطالب تحديد طريقة لقياس تقدم هدفه مع اعطاء مثال",
        "دع الطالب يفكر في موارده الحالية مثل الوقت و الدعم و الادوات وتحديد ما اذا كان هدفهم قابلا للتحقيق ام يحتاج تعديل ، مع تقديم امثلة",
        "دع الطالب يفكر في ان يكون هدفه ذو صلة بما هو مهم للطالب على المستوى الشخصي او الاكاديمي ، مع تقديم امثلة",
        "اطلب من الطالب تحديد اطار زمني لهدفه و تحديد محطات زمنية لمراجعة تقدمهم",
        "اطلب من الطالب تحديد هدف شخصي حسب معايير سمارت",
        "اطلب من الطالب تحديد هدف شخصي حسب معايير سمارت"
      ]
    },
    {
      "stage": "استراتيجية حل المشكلات لتعزيز الثقة بالنفس",
      "description": "تعليم الطلبة كيفية تحليل المشكلات و وضع حلول فعالة للتغلب عليها مما يعزز الشعور بالكفاءة و الثقة في مواجهة التحديات",
      "explanations": [
        "تعريف مفهوم حل المشكلات و اهمية تطوير هذه المهارة",
        "شرح كيف ان القدرة على حل المشكلات تعزز الثقة بالنفس لانها تمنح الشخص شعورا بالقدرة على التعامل مع المواقف الصعبة",
        "عرض امثلة لمشاكل تواجه الطلاب في الحياة الاكاديمية و الشخصية و كيف يمكن حلها"
      ],
      "questions": [
        "لفهم المشكلة بشكل صجيج ، اطلب من الطالب كتابة مشكلة يواجهها في حياته الاكاديمية او الشخصية",
        "تحليل اسباب المشكلة ، اجعل الطالب يفكر في الاسباب المحتملة للمشكلة",
        "اطلب من الطالب التفكير في كل الحلول المحتملة لمشكلته",
        "اطلب من الكالب تقييم الحلول التي كتبها و تحديد الاكثر قابلية للتنفيذ",
        "اطلب من الطالب اختيار الحل الأكثر ملاءمة لمشكلتهم و شرح سبب اختياره",
        "لطلب من الطالب وضع خطة لتطبيق الحل المختار مع تحديد فترة زمنية لتقييم النتائج",
        "اطلب من الطالب تحديد العقبات المحتملة",
        "اطلب من الطالب تقييم الحلول التي اقترحها ثم اختيار الحل الأمثل"
      ]
    },
    {
      "stage": "اتخاذ القرارات",
      "description": "تمكين الطلاب من فهم عملية اتخاذ القرار و تزويدهم بالأدوات اللازمة لاتخاذ قرارات صائبة في حياتهم الاكاديمية و الشخصية",
      "explanations": [
        "قم بتعريف اتخاذ القرار و اهمية اتخاذ القرار",
        "اذكر انواع القرارات و العوامل المتحكمة في اتخاذ القرار"
      ],
      "questions": [
        "اطلب من الطالب تحديد قرار يرغب في اتخاذه و كتابة جميع الخيارات المتاحة",
        "اشرح نموذج Decide و اطلب من الطالب تحديد قرار حسب هذا النموذج",
        "اطلب من الطالب التفكير في عواقب قرار اتخذه مسبقا سواءا كانت ايجابية او سلبية"
      ]
    },
    {
      "stage": "تنفيذ القرار",
      "description": "تعليم الطلاب كيفية اتخاذ القرارات و تنفيذها بنجاح",
      "explanations": [
        "شرح الفرق بين اتخاذ القرار و تنفيذ القرار",
        "أكد على ان التنفيذ هو الجزء الحاسم الذي يحرر نجاح القرار",
        "شرح كيفية تأثير تنفيذ القرارات بنجاح على زيادة الثقة بالنفس",
        "اشرح مراحل تنفيذ القرار(التخطيط لكيفية تنفيذ القرار ، البدء في التنفيذ ، مراقبة التقدم ، التكيف و التعديل)"
      ],
      "questions": [
        "اطلب من الطالب اختيار قرار قد تم اتخاذه مسبقا واطلب منه وضع خطة لتنفيذه مع اعطاء مثال و اعتبار الخطوات المطلوبة و الاطار الزمني و الموارد المطلوبة",
        "اطلب من الطالب التفكير في التحديات او العقبات المحتملة التي قد تظهر خلال تنفيذ القرار مع الطلب منه ان يقترح بدائل في حالة عدم نجاح الخطة الاولى",
        "اطلب من الطالب ان يتذكر قرار انجزه و يصف الشعور الذي احس به و يسف كسف سيساعده ذلك في المضي قدما نحو تحقيق اهداف اكبر"
      ]
    },
    {
      "stage": "فنيات و مهارات التواصل",
      "description": "تهدف هذه الجلسة إلى تعزيز قدرة الطالب على التواصل الفعال في البيئات الاكاديمية او الشخصية حيث انها تعزز الثقة في النفس و تساعد الطالب على بناء علاقات افضل و حل المشاكل بفعالية اكثر",
      "explanations": [
        "شرح تأثير مهارات التواصل على النجاح الاكاديمي و المهني",
        "كيفية تأثير التواصل الجيد في بناء علاقات اجتماعية ناجحة و زيادة الثقة بالنفس",
        "توضيح ان التواصل ليس مجرد كلمات بل يشمل الاستماع الجيد و لغة الجسد و التعبير عن المشاعر و الافكار بوضوح"
      ],
      "questions": [
        "اطلب من الطالب كتابة رسالة قصيرة او تقديم خطاب حول موضوع معين مع التركيز على الوضوح و التعيبر المباشر",
        "اطلب من الطالب كتابة بريد الكتروني على استاذ يطلب منه توضيحا حول موضوع معين",
        "قدم للطالب سيناريو خيالي حول شخص يتحدث عن موقف صعب واجهه في دراسته و اطلب من الطالب الاستجابة للسيناريو المقدم بطريقة تظهر الدعم و التعاطف"
      ]
    },
    {
      "stage": "تنمية المهارات الاجتماعية",
      "description": "تهدف هذه الجلسة الى تعزيز المهارات الاجتماعية للطلاب مما يمكنهم من بناء علاقات ايجابية و التفاعل بفاعلية في البيئات المختلفة",
      "explanations": [
        "شرح كيف تساهم المهارات الاجتماعية في تحسين العلاقات الشخصية و المهنية",
        "شرح تأثير المهارات في النجاح الاكاديمي و المهني و زيادة الثقة بالنفس",
        "توضيح ان المهارات الاجتماعية تشمل القدرة على العمل مع الاخرين و ادارة الصراعات و بناء علاقات صحية",
        "شرح العناصر الاساسية للمهارات الاجتماعية (التواصل الفعال ، الاستماع النشط ، التعاطف ، التفاوض ، العمل الجماعي)"
      ],
      "questions": [
        "اقترح على الطالب سيناريو يتطلب التعاطف و اطلب منه شرح كيف يتعاطف معه",
        "اقترح للطالب سيناريو خيالي عن شخص يتحدث حول هواياته و اهتماماته و اطلب من الطالب شرح ما قاله الشخص",
        "اقترح سيناريو خيالي يمثل نزاع بين شخصين و اطلب من الطالب شرح كيف يمكنه حل النزاع"
      ]
    },
    {
      "stage": "مواجه الخجل",
      "description": "تهدف هذه الجلسة إلى مساعدة الطلاب على التغلب على مشاعر الخجل و معرفة اسبابها و تعزيز ثقتهم في انفسهم و تمكينهم من التفاعل بشكل اكثر فاعلية في مختلف المواقف الاجتماعية",
      "explanations": [
        "توضيح كيف يمكن ان يؤثر الخجل على الجياة اليومية و العلاقات الشخصية",
        "شرح العناصر الرئيسية لمواجهة الخجل (التعرف على المشاعر ، تطوير الثقة بالنفس ، استخدام تقنيات الاسترخاء ، التعرض التدريجي)"
      ],
      "questions": [
        "اطلب من الطالب كتابة قائمة بالمواقف التي يشعرون فيها بالخجل",
        "حدد للطالب احد المواقف التي يشعر فيها بالخجل و اطلب منه ان يقول كيف يتعامل مع هذا الموقف",
        "اشرح للطالب احد تقنيات الاسترخاء مع تقديم مثال و شرح اهميتها في تخفيف مشاعر الخجل"
      ]
    },
    {
      "stage": "قيادة جلسة حوارية",
      "description": "تهدف هده الجلسة إلى تطوير مهارات القيادة لدى الطلاب من خلال تنظيم و ادارة جلسات حوارية فعالة مما يعزز الثقة بالنفس و القدرة على التواصل الفعال",
      "explanations": [
        "تعريف القيادة و اهميتها في الحوار",
        "شرح العناصر الاساسية لقيادة جلسات حوارية (تحديد الاهداف ، تسيير الحوار ، الاستماع الفعال ، ادارة الوقت)"
      ],
      "questions": [
        "قدم سيناريو خيالي للطالب حيث يجب عليه تحديد اهداف محادثة قبل بدايتها",
        "قدم سيناريو حواري خيالي حيث يجب على الطالب قيادة الحوار و اسأل الطالب كيف يمكنه قيادة الحوار",
        "اقترح سيناريو خيالي للطالب حول شخص يقوم بالتحدث عن موضوع مهم ثم اطلب من الطالب ان يعيد صياغة الموضوع",
        "اقترح للطالب سيناريو خيالي لشخص يلقي خطابا ثم اطلب من الطالب التعليق على ذلك الخطاب"
      ]
    },
    {
      "stage": "الحديث عن الذات و مع الذات",
      "description": "تهدف هذه الجلسة إلى تعويو وعي الطلاب بأنفسهم و تمكينهم من تحسير الحوار الذي يؤثر على ثقتهم بالنفس و مشاعرعهم العامة",
      "explanations": [
        "تعريف الحديث مع الذات و كيف يؤثر على الثقة بالنفس و المزاج العام و الفرق بين الحديث الايجابي مع الذات و السلبي",
        "شرح العناصر الاساسية للحديث الايجابي مع الذات (التقدير الذاتي ، تحدي الأفكار السلبية ، وضع الأهداف)"
      ],
      "questions": [
        "اطلب من الطالب كتابة الافكار السلبية التي تراوده بشكل متكرر",
        "اطلب من الطالب اختيار فكرة سلبية و اعاتد صياغتها لتصير فكرة اجابية مع تقديم مثال",
        "اطلب من الطالب كتابة مجموعة من التأكيدات الايجابية التي يمكنه استخدامها يوميا مع تقديم مثال",
        "اطلب من الطالب كتابة نص قصير عن نفسه مع التركيز على الصفات الايجابية و الانجازات",
        "اطلب من الطالب كتابة قائمة بانجازاته سواءا كانت صغيرة او كبيرة"
      ]
    },
    {
      "stage": "تحمل المسؤولية",
      "description": "تهدف هذه الجلسة إلى تعزيز وعي الطالب بأهمية تحمل المسؤولية في حياتهم سواء في السياق الاكاديمي او الشخصي لان تحمل المسؤولية يؤدي إلى تعزيز الثقة بالنفس و تحسين العلاقات و النجاح في الأهداف",
      "explanations": [
        "تعريف تحمل المسؤولية و اهمية تحمل المسؤولية و الفرق بين المسؤولية الجماعية و الشخصية",
        "شرح العناصر الاساسية لتحمل المسؤولية (التفكير النقدي ، الالتزام ، تقبل العواقب، القدرة على التعلم من الأخطاء)"
      ],
      "questions": [
        "اطلب من الطالب كتابة قائمة بمسؤولياته الاكاديمية و الاجتماعية",
        "اطلب من الطالب اختيار قرار اتخذه من قبل و تقييم العواقب الايجابية و السلبية لهذا القرار",
        "اطلب من الطالب ان يكتب اهداف قصيرة و طويلة المدى مع خطة لتحقيقها",
        "اطلب من الطالب كتابة تجربة سابقة ارتكب فيها خطأ و كيف تعلم منه",
        "اطلب من الطالب التفكير في قرار معين و تحديد العواقب المحتملة"
      ]
    },
    {
      "stage": "الاهتمام بالمظهر",
      "description": "تهدف هذه الجلسة إلى تعزيز وعي الطالب بأهمية الاهتمام بالمظهر الشخصي و كيف يؤثر ذلك على ثقته بنفسه و انطباع الآخرين حيث يعتبر المظهر الجيد جزءا مهما من الانطباعات الأولى و قذ يؤثر على العلاقات الاجتماعية و النجاح الاكاديميو المهني",
      "explanations": [
        "تقديم مقدمة عن اهمية المظهر و كيف يؤثر على الثقة بالنفس و الانطباعات الأولى و العلاقة بين المظهر و التواصل الاجتماعي و النجاح الاكاديمي",
        "شرح العناصر الاساسية للاهتمام بالمظهر(الملابس ، النظافة الشخصية ، الأسلوب الشخصي)"
      ],
      "questions": [
        "اطلب من الطالب النظر الى صورته و تقييم مظهره بناءا على معايير محددة مثل النظافة و ترتيب الملابس و الاناقة",
        "اطلب من الطالب اختيار مجموعة من الملابس المناسبة لكل مناسبة مختلفة كالدراسة و المناسبات الاجتماعية و المقابلات",
        "اطلب من الطالب وضع خطة شخصية لتحسين عادات النظافة الشخصية مثل الاستحمام و العناية بالبشرة و تنظيف الاسنان",
        "اطلب من الطالب التفكير في كيفيى تعبيره عن نفسه من خلال ملابسه و مظهره",
        "اطلب من الطالب اعداد مظهره لمناسبة معينة من اقتراحك"
      ]
    },
    {
      "stage": "الذكاء العاطفي",
      "description": "تمكين الطلاب من فهم الذكاء العاطفي و كيفية استخذامه في تحسين العلاقات الشخصية و الأداء الأكاديمي",
      "explanations": [
        "نعريف الذكاء العاطفي و اهميته في الحياة اليومية",
        "شرح مكونات الذكاء العاطفي(الوعي الذاتي ، الادارة الذاتية ، الوعي الاجتماعي ، ادارة العلاقات)"
      ],
      "questions": [
        "اطلب من الطالب تسجيل كتابة المشاعر التي احس بها خلال اليوم",
        "اطلب من الطالب التفكير في موقف يشعره بالتوتر و استخدام تقنية التنفس الميق او التأمل مع تقديم امثلة",
        "اطلب من الطالب التفكير في موقف تعرف فيه شخص آخر لمشاعر قوية و التخيل كيف يمكنه مساعدته"
      ]
    }
  ]
}

        for i, session in enumerate(therapy_data["therapySessions"]):
            stage, created = Stage.objects.get_or_create(
                order=i,
                defaults={
                    "name": session["stage"],
                    "description": session["description"],
                    "is_chat": True
                }
            )

            for explanation_text in session.get("explanations", []):
                Explanation.objects.get_or_create(stage=stage, explanation=explanation_text)

            for j, question_text in enumerate(session.get("questions", [])):
                Question.objects.get_or_create(stage=stage, order=j, question=question_text)

        self.stdout.write(self.style.SUCCESS("Therapy session data successfully populated."))
